# 题目：请同学们用Python中的海龟库完成对应的图形
# 要求：
# （1）画笔颜色为蓝色；
# （2）每个小正方形的大小为 30 ；
# （3）设置画笔隐藏；
import turtle   # 导入海龟库

t = turtle.Turtle()  # 拿出画笔
t.ht()  # 隐藏画笔
t.color("blue")  # 改变画笔颜色为蓝色
for i in range(4):  # 循环4次
    t.forward(90)  # 循环中画长度为90的直线
    t.left(90)  # 循环中画笔左转90度
t.up()  # 抬起画笔
t.goto(0, 30)  # 将画笔移动到(0,30)的位置
t.down()  # 落下画笔
t.forward(90)  # 画长度为90的直线
t.up()  # 抬起画笔
t.goto(0, 60)  # 将画笔移动到(0,60)的位置
t.down()  # 落下画笔
t.forward(90)  # 画长度为90的直线
t.left(90)  # 画笔左转90度
t.up()  # 抬起画笔
t.goto(30, 0)  # 将画笔移动到(30,0)的位置
t.down()  # 落下画笔
t.forward(90)  # 画长度为90的直线
t.up()  # 抬起画笔
t.goto(60, 0)  # 将画笔移动到(60,0)的位置
t.down()  # 落下画笔
t.forward(90)  # 画长度为90的直线
turtle.done()  # 完成绘制，不关闭窗口
